from schemas.book import Book

books_list = [
    Book(
        author="Краковский М.Б., Тихонов И.Н.",
        title="Особенности расчетов нормальных сечений железобетонных конструкций по СП 63.13330.2018",
        year=2023,
        publishing="Москва",
        isbn="1234",
        description="Провести исследование по сопоставлению результатов, получаемых при расчетах по НДМ и МПУ, вывить различия, установить их физическую причину, оценить экономические аспекты проблемы, дать необходимые рекомендации."
    ),
    Book(
        author="Зенин С.А.",
        title="Параметрическое нормирование железобетонных конструкций. Бетон и железобетон",
        year=2025,
        publishing="Москва",
        isbn="",
        description=""
    ),
    Book(
        author="Лебедева И.В., Петрова Т.А.",
        title="Анализ современных подходов к оценке надежности в строительстве",
        year=2023,
        publishing="Строительство",
        isbn="",
        description=""
    ),
    Book(
        author="Николенко К.С., Абсиметов В.Э.",
        title="Сборник докладов VI Международной научно-практической конференции, посвященной 50-летию кафедры строительства и городского хозяйства.",
        year=2022,
        publishing="Белгород",
        isbn="",
        description=""
    ),
    Book(
        author="",
        title="СП 52-103-2007. Железобетонные монолитные конструкции зданий.",
        year=2007,
        publishing="Москва",
        isbn="",
        description=""
    ),
    Book(
        author="",
        title="СП 63.13330.2012. Бетонные и железобетонные конструкции. Основные положения. Актуализированная редакция СНиП 52-01-2003.",
        year=2023,
        publishing="",
        isbn="",
        description=""
    ),
    Book(
        author="Дорофеев А.А.",
        title="Разработка  и внедрение  научно-методического обеспечения совершенствования  инженерного образования и создание системы подготовки  и повышения квалификации  преподавателей  технических  вузов",
        year=2024,
        publishing="Москва",
        isbn="",
        description=""
    ),
    Book(
        author="Колубков А.Н.",
        title="Параметрический метод нормирования. постоянное стремление к изменениям.",
        year=2023,
        publishing="",
        isbn="",
        description=""
    ),
    Book(
        author="Гуров Л.И.",
        title="Технологические университеты в контексте глобализации интеграции образования",
        year=2023,
        publishing="Интеграция образования",
        isbn="",
        description=""
    ),
    Book(
        author="Мелецинек А.В.",
        title="Инженерная педагогика. Практика передачи технических знаний",
        year=2023,
        publishing="МАДИ",
        isbn="",
        description=""
    ),
]