from schemas.book import Book

books_list = [
    Book(
        id=0,
        author="Краковский М.Б., Тихонов И.Н.",
        title="Особенности расчетов нормальных сечений железобетонных конструкций по СП 63.13330.2018",
        year=2023,
        publishing="Москва",
        isbn="1234",
        description="Провести исследование по сопоставлению результатов, получаемых при расчетах по НДМ и МПУ, вывить "
                    "различия, установить их физическую причину, оценить экономические аспекты проблемы, дать "
                    "необходимые рекомендации."
    ),
    Book(
        id=1,
        author="Зенин С.А.",
        title="Параметрическое нормирование железобетонных конструкций. Бетон и железобетон",
        year=2025,
        publishing="Москва",
        isbn="",
        description="Оценка перехода на параметрическое нормирование в части проектирования железобетонных конструкций."
    ),
    Book(
        id=2,
        author="Лебедева И.В., Петрова Т.А.",
        title="Анализ современных подходов к оценке надежности в строительстве",
        year=2023,
        publishing="Строительство",
        isbn="",
        description=" Рассматриваются современные стратегии в области обеспечения надежности строительных конструкций в "
                    "отечественной и зарубежной нормативных базах, включая вероятностные, риск-информированные и "
                    "полувероятностные критерии оценки надежности, на всех этапах жизненного цикла сооружения. Приведен "
                    "анализ преимуществ и недостатков предписывающих и параметрических подходов и предложены пути их "
                    "дальнейшего совершенствования"
    ),
    Book(
        id=7,
        author="Группа авторов",
        title="Наука и инновации в строительстве, международная научно-практическая конференция",
        year=2022,
        publishing="Белгород",
        isbn="978-5-361-01013-4",
        description='VI Международная научно-практическая конференция "Наука и инновации в строительстве", посвященная '
                    '50-летию Кафедры строительства и городского хозяйства (Белгород, 14 апреля 2022 г.) : сборник '
                    'докладов / Министерство науки и высшего образования Российской Федерации, Департамент строительства'
                    ' и транспорта Белгородской области, Белгородский государственный технологический университет им. В.'
                    ' Г. Шухова, Инженерно-строительный институт, Кафедра строительства и городского хозяйства. '
    ),
    Book(
        id=15,
        author="А.С.Залесов, А.С.Семченков, Е.А.Чистяков, С.Б.Крылов",
        title="СП 52-103-2007. Железобетонные монолитные конструкции зданий.",
        year=2007,
        publishing="Москва",
        isbn="",
        description='Настоящий Свод правил разработан в развитие СНиП 52-01-2003 "Бетонные и железобетонные конструкции.'
                    ' Основные положения". Объем строительства зданий различного назначения из монолитного железобетона '
                    'в последние годы значительно возрос. В то же время практика проектирования не имеет в своем '
                    'распоряжении документа, где были бы объединены основные требования, выполнение которых обеспечивает'
                    ' надежность и безопасность такого вида зданий. Настоящий Свод правил ставит своей целью восполнить '
                    'этот пробел.'
    ),
    Book(
        id=16,
        author="",
        title="СП 63.13330.2012. Бетонные и железобетонные конструкции. Основные положения. Актуализированная редакция СНиП 52-01-2003.",
        year=2013,
        publishing="",
        isbn="",
        description="Настоящий свод правил распространяется на проектирование бетонных и железобетонных конструкций "
                    "зданий и сооружений различного назначения, эксплуатируемых в климатических условиях России (при "
                    "систематическом воздействии температур не выше 50°С и не ниже минус 70°С), в среде с неагрессивной "
                    "степенью воздействия."
    ),
    Book(
        id=17,
        author="Дорофеев А.А.",
        title="Разработка  и внедрение  научно-методического обеспечения совершенствования  инженерного образования и создание системы подготовки  и повышения квалификации  преподавателей  технических  вузов",
        year=2024,
        publishing="Москва",
        isbn="",
        description=""
    ),
    Book(
        id=18,
        author="Колубков А.Н.",
        title="Параметрический метод нормирования. постоянное стремление к изменениям.",
        year=2023,
        publishing="",
        isbn="",
        description=""
    ),
    Book(
        id=19,
        author="Гуров Л.И.",
        title="Технологические университеты в контексте глобализации интеграции образования",
        year=2023,
        publishing="Интеграция образования",
        isbn="",
        description=""
    ),
    Book(
        id=20,
        author="Мелецинек А.В.",
        title="Инженерная педагогика. Практика передачи технических знаний",
        year=2023,
        publishing="МАДИ",
        isbn="",
        description=""
    )
]
